//number, string, math객체와 매서드 알아보자.

//1-1.toFixed매서드 =>몇번째 자리까지 자를꺼니? ex(2)넣으면 소수2번째 자료까지 자른다. 숫자자료형이 아닌 문자열 자료형으로 자르는게 기본.
const a = 123.456
a.toFixed(2) ///123.45

//1-2.isNan()  => 매개변수에 nan이면 true, 아니면 false.  nan?? => 숫자자료형인데 숫자가 아닌 것

Number('hi')  // => nan
const b = Number('hii')
Number.isNaN(b)   //true

const c = Number(13)
Number.isNaN(c)     //nan이 아니므로 false


//1-3. isFinite()   //유한하면 true, 셀수없으면(infinity)면 falsed







////////////////////////////////////////////////string매서드//////////////////////////////////
//2-1. trim()  => 공백제거

`

ㅇㅅㅇ

`.trim()   //=> "ㅇㅅㅇ"
'       ㅇㅇㅇ      '.trim()         //'ㅇㅇㅇ'





//2-2. split()  => 기준을 정해 잘라 배열로 만들고 싶을때
'20.05.02,ddd,ㅇㄹㄴㄹㅇㄹ,212344'
'20.05.02,ddd,ㅇㄹㄴㄹㅇㄹ,212344'.split(',')   
//=> (4) ['20.05.02', 'ddd', 'ㅇㄹㄴㄹㅇㄹ', '212344'] 쉼표를 기준으로 잘라 배열로 생성
//응용
const input = `
일자,달러,엔,유로
02,1141.8,1056.46,1254.37
03,1142.8,1055.22,1253.22
04,1145.9,1112.25,1266.22
`
input.trim()  //'일자,달러,엔,유로\n02,1141.8,1056.46,1254.37\n03,1142.8,1055.22,1253.22\n04,1145.9,1112.25,1266.22'
input.trim().split('\n')  //\n을 기준으로 잘라서 배열로 만든다.
`
(4) ['일자,달러,엔,유로', '02,1141.8,1056.46,1254.37', '03,1142.8,1055.22,1253.22', '04,1145.9,1112.25,1266.22']
0: "일자,달러,엔,유로"
1: "02,1141.8,1056.46,1254.37"
2: "03,1142.8,1055.22,1253.22"
3: "04,1145.9,1112.25,1266.22"
length: 4
`

input.trim().split('\n').map((linesss) => linesss.split(','))  //앞에서 만든 배열들을, 
`(4) [Array(4), Array(4), Array(4), Array(4)]
0: (4) ['일자', '달러', '엔', '유로']
1: (4) ['02', '1141.8', '1056.46', '1254.37']
2: (4) ['03', '1142.8', '1055.22', '1253.22']
3: (4) ['04', '1145.9', '1112.25', '1266.22']
length: 4
`

//3.math객체








